app/views/invoices/_form.html.erb


    <%= f.association :firm, selected: Firm.first.id %>
    <%= f.association :client, collection: Client.order('created_at DESC'), label: 'Kies klant', include_blank: false %>
---
SELECT  `firms`.* FROM `firms` ORDER BY `firms`.`id` ASC LIMIT 1
SELECT `clients`.* FROM `clients` ORDER BY created_at DESC