app/views/clients/_form.html.erb

    <div class="controls">
      <%= f.association :firm, selected: Firm.first.id %>
---
SELECT  `firms`.* FROM `firms` ORDER BY `firms`.`id` ASC LIMIT 1