app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients`
---
  def index
    @clients = Client.all

INSERT INTO `clients` (`firm_id`, `name`, `email`, `phone`, `fax`, `vat`, `bank`, `address`, `created_at`, `updated_at`) VALUES (1, 'Engie ETS', 'info@engie.be', 'some phone', '', 'todo engie vat here', 'BE927489237429423', 'todo', '2020-12-24 16:19:29', '2020-12-24 16:19:29')
---
  def create
    #@client = Client.new(params[:client])
    @client = Client.new(client_params)

    if @client.save

UPDATE `clients` SET `vat` = 'BE243242442', `phone` = '35233532532523', `address` = 'Rue somewehre 243\r\nBrussel', `updated_at` = '2020-12-24 16:52:25' WHERE `clients`.`id` = 1
---
  def update
    if @client.update(client_params)

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
    def set_client
      @client = Client.find(params[:id])