app/controllers/firms_controller.rb

SELECT `firms`.* FROM `firms`
---
  def index
    @firms = Firm.all

SELECT  `firms`.* FROM `firms` WHERE `firms`.`id` = 1 LIMIT 1
---
  def show
    @firm = Firm.find(params[:id])

SELECT  `firms`.* FROM `firms` WHERE `firms`.`id` = 1 LIMIT 1
---
  def edit
    @firm = Firm.find(params[:id])

INSERT INTO `firms` (`logo`, `name`, `email`, `phone`, `fax`, `vat`, `bank`, `created_at`, `updated_at`) VALUES ('', 'SIT bvba', 'info@sitweb.eu', '+32486118836', '', 'BE0818203809', 'todo sit bank here', '2020-12-24 16:18:08', '2020-12-24 16:18:08')
---
  def create
    @firm = Firm.new(firm_params)

    respond_to do |format|
      if @firm.save

SELECT  `firms`.* FROM `firms` WHERE `firms`.`id` = 1 LIMIT 1
UPDATE `firms` SET `address` = 'Grote Kauwenberg 13\r\n2000 Antwerpen', `updated_at` = '2020-12-24 16:43:20' WHERE `firms`.`id` = 1
---
  def update
    @firm = Firm.find(params[:id])

    respond_to do |format|
      if @firm.update_attributes(firm_params)