app/controllers/invoices_controller.rb

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` IN (2, 1)
SELECT `invoice_lines`.* FROM `invoice_lines` WHERE `invoice_lines`.`invoice_id` IN (2, 1)
SELECT `invoices`.* FROM `invoices` ORDER BY number DESC
---
  def index
    if params[:q].blank?
      @invoices = Invoice.includes(:client).includes(:invoice_lines).order('number DESC').all

INSERT INTO `invoices` (`client_id`, `firm_id`, `number`, `offerte`, `no_vat`, `datum`, `created_at`, `updated_at`) VALUES (1, 1, 2020120001, 1, 0, '2020-12-24 00:00:00', '2020-12-24 16:30:57', '2020-12-24 16:30:57')
---
  def create
    @invoice = Invoice.new(invoice_params)
    @invoice.generate_number(invoice_params[:offerte])

    if @invoice.save

UPDATE `invoices` SET `number` = 2020120005, `firm_id` = 1, `offerte` = 0, `updated_at` = '2020-12-24 16:56:12' WHERE `invoices`.`id` = 2
---
  def update
    @invoice.generate_number(invoice_params[:offerte])

    if @invoice.update_attributes(invoice_params)

SELECT  `invoices`.* FROM `invoices` WHERE `invoices`.`id` = 1 LIMIT 1
---
  def set_invoice
    @invoice = Invoice.find(params[:id])